
{
      "article1": {"background":"https://advantedgeadvisors.com/wp-content/uploads/2017/11/THEDIF1.jpg",
        "title":"The Difference Between Business Brokers, M&A Advisors, and Investment Bankers",
        "textList":"When selling your business, you need a knowledgeable, expert advisor. You only get one chance to sell, so the wrong advisor could cost a part of your retirement. These intermediaries are often called mergers and acquisitions (M&A) advisors, business brokers, or investment bankers.,All business sales advisors have a common goal: managing the sale process by evaluating and marketing your business, negotiating the deal, and ensuring the transaction closes. The approach varies with the size of the business and the type of expert retained. Because each type of advisor specializes in a specific portion of market, you should seek an intermediary who fits the needs of your business.,Business Brokers,Business Brokers typically work with companies that have under $10 million in annual revenues. These “main street” businesses are often local service providers, such as restaurants, convenience stores, dry cleaners, and other small businesses in which the owner will likely become the owner-operator.,These projects typically yield lower fees, so brokers often handle numerous engagements—often as many as 10 sales at a time. For this reason, they can only offer limited attention, and their marketing strategy may be limited to posting the listing on various sites. Their expertise varies, and may be limited, since the fees earned in this position are often lower. Even some commercial real estate agents sometimes offer business brokerage services.,M&A Advisors,M&A intermediaries or advisors work with business owners with revenues between $10 million and $100 million. These professionals know how to attract private equity firms and strategic buyers, as well as individuals of high net worth. They are familiar with a range of financing options to facilitate complex capital structures.,M&A advisors limit themselves to one to two engagements at a given time. This enables them to offer in-depth analysis and marketing advice, and to spend significant time with each client.,Larger deals are often complex, so M&A intermediaries often work with a team of advisors, including accountants, financial analysts, and attorneys. This deal team works together to ensure a successful sale. M&A advisors typically charge a retainer fee to compensate themselves for the massive work involved in evaluating the business and marketing it. However, the best advisors collect the bulk of their fees following a successful sale. This fee usually follows a scaled percentage formula.,Investment Bankers,Investment bankers serve clients in mid to upper-level markets, working with owners of public and private businesses with annual revenues in excess of $100 million. These firms network with businesses and private equity groups seeking to acquire larger companies. Though knowledgeable, they often can’t tap a network of buyers seeking to acquire smaller entities.,Investment bankers offer strategic M&A advice, in addition to helping clients raise debt and equity capital, refinance, and recapitalize. Their fees vary and are negotiable.,Conclusion,The right intermediary is a key player in a business sale. It’s important to interview several before retaining an intermediary. An experienced broker who sells ice cream shops might have no idea how to handle a manufacturing, construction, or distribution business. The right intermediary has experience in your industry, and is a good fit for your unique needs.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
      "article2": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/02/What-is-My-Business-Worth-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"What is My Business Worth?",
        "textList":"When thinking about taking your company to market the first thing that crosses the mind of most business owners is “what is my business worth?” Sure, you may have hired a valuation firm to put a value on your businesses for estate purposes, but those valuations have no concrete tie to what your business is really worth.,The real answer is that your business is worth what a buyer is willing to pay for it. Any buyer will perform their own valuation, which includes assessing the strategic value of your business in their hands. Your independent valuation, while helpful in some instances (estate planning, buy/sell agreements, etc.), is not something a buyer will consider when valuing your business.,Valuation Methods,Ok, so what are some other methods that a potential buyer will employ when trying to value your business? Comparable transactions are a reasonable way to understand the relative value of your business. If one of your competitors was recently acquired, and they offer similar products or services to you, it is reasonable to think that their value is in line with yours.,However, the strategic implications of the buyer can certainly swing the value one way or another. For example, a larger strategic competitor will certainly have more synergies and typically see greater value in your business than a purely financial buyer.,Another aspect sometimes used to value businesses is comparing your company that of publically traded companies in the same industry and then discounting the trading multiple. How much the multiple is discounted depends on the buyer, but generally the discount is usually somewhere in the 30% range. The discount is employed because privately held companies are not liquid in the way that public companies are.,Doing It the Hard Way,The best way to really find the value of your company is to put the work in. There is no simple model or formula that can truly generate an accurate valuation. Hiring an investment banker or M&A Advisor to market your business in a professional manner to multiple parties in the best way to really understand the value of your business.,An M&A Advisor or investment banker will put together a selling document called a Confidential Information Memorandum (CIM) detailing all aspects of your business including core competencies, growth opportunities, strategic considerations and historic and projected financials. This will really give potential buyers a true understanding of your business. An investment banker or M&A Advisor will also facilitate meetings between you and potential buyers so that those buyers can ask any questions and understand the potential of your business.,Marketing your business to multiple buyers in the hope of generating multiple offers in an auction setting will give you, the seller, the opportunity to understand the way multiple parties would value your business. If one of those offers is acceptable then you’ll truly know what the value on the business is.,So, like everything else in life, there is no easy way out. The only way to really understand the value of your business is to take it to market and put it in front of potential buyers.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article3": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2020/09/Benefits-of-An-Advisor-Beyond-Finding-a-Buyer.jpg",
        "title":"Benefits of An Advisor: Beyond Finding a Buyer",
        "textList":"PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article4": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2019/06/Why-You-Should-Exit-While-You’re-Ahead-–-A-Cautionary-Tale-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Why You Should Exit While You’re Ahead – A Cautionary Tale",
        "textList":"PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article5": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2019/05/5-Reasons-Why-Your-Business-is-Too-Dependent-on-You-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"5 Reasons Why Your Business is Too Dependent on You",
        "textList":"If you were to draw a picture that visually represents your role in your business, what would it look like? Are you at the top of an organizational chart, or stuck in the middle of your business like a hub in a bicycle wheel?,The Hub & Spoke model is a drive that shows how dependent your business is on you for survival. The Hub & Spoke model can be only as strong as the hub. The moment the hub is overwhelmed, the entire system fails. Acquirers generally avoid these types of managed businesses because they understand the dangers of buying a company too dependent on the owner.,Here’s a list of the 5 top warning signs that show your business could be too dependent on you:,1. You are the only signing authority,Most business owners give themselves final authority… all the time. But what happens if you’re away for a couple of days and an important supplier needs to be paid? Consider giving an employee signing authority for an amount you’re comfortable with, and then change the mailing address on your bank statements so they are mailed to your home (not the office). That way, you can review everything coming out of your account and make sure the privilege isn’t being abused.,2. Your revenue is flat when compared to last year’s,Flat revenue from one year to the next can be a sign you are a hub in a hub-and-spoke model. Like forcing water through a hose, you have only so much capacity. No matter how efficient you are, every business dependent on its owner reaches capacity at some point. Consider narrowing your product and service line by eliminating technically complex offers that require your personal involvement, and instead focus on selling fewer things to more people.,3. Your vacations… don’t feel like vacations,If you spend your vacations dispatching orders from your mobile, it’s time to cut the tether. Start by taking one day off and seeing how your company does without you. Build systems for failure points. Work up to a point where you can take a few weeks off without affecting your business.,4. You know all of your customers by first name,It’s good to have the pulse of your market, but knowing every single customer by first name can be a sign that you’re relying too heavily on your personal relationships being the glue that holds your business together. Consider replacing yourself as a rain maker by hiring a sales team, and as inefficient as it seems, have a trusted employee shadow you when you meet customers so over time your customers get used to dealing with someone else.,5. You get cc’d on more than five e-mails a day,Employees, customers and suppliers constantly cc’ing you on e-mails can be a sign that they are looking for your tacit approval or that you have not made clear when you want to be involved in their work. Start by asking your employees to stop using the cc line in an e-mail; ask them to add you to the “to” line if you really must be made aware of something – and only if they need a specific action from you.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article6": {"background":"https://advantedgeadvisors.com/wp-content/uploads/2019/04/Why-Companies-are-Adopting-Subscription-Billing-Models-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Why Companies are Adopting Subscription Billing Models",
        "textList":"Volvo recently announced they will make their cars available on a subscription model where consumers will pay one fixed fee per month for access to a car which includes insurance and maintenance.,Everything from tooth brushes to flowers are now available with subscription billing.,Could you offer some sort of recurring plan to your customers? Here are six reasons to consider offering your customers a subscription:,1. Predictability: When you have subscribers, you can plan what your business needs in the future. For example, the average flower store in America throws out more than half of its inventory each month because it’s too rotten to sell. At H.Bloom, a subscription-based flower company that sells flowers to hotels and spas, say they throw out less than 2% of their flowers because they can perfectly predict how many flowers are needed to fulfill their orders.,2. Eliminate Seasonality: Many businesses suffer through seasonal highs and lows. In fact, a whopping thirty percent of a typical flower store’s revenue comes on Mother’s Day and Valentine’s Day – ultimately leaving them to scramble and make a sale in November. By contrast, H.Bloom has a steady stream of subscribers that pay each month. At Mister Car Wash – where they offer a subscription for unlimited car washes – they receive revenue from customers in November and April even though very few people in the Northern east wash their cars in rainy months.,3. Improved Valuation: Recurring revenue boosts the value of your business. Whereas most small companies trade on a multiple of profit, subscription-based businesses often trade on a similar multiple of revenue.,4. The Trojan Horse Effect: Once you subscribe to a service, you become much more likely to buy other things from the same company. That’s one reason Amazon is so keen to get you to buy subscriptions to things like Prime or Subscribe & Save. Amazon knows that once you become a subscriber, you are much more likely to buy additional products.,5. The Sale That Keeps On Giving: Unlike the transaction business model where you have to stimulate demand through advertising to get customers to buy, with a subscription based model, you sell one subscription and it keeps giving month after month.,6. Data & Market Research: When you get a customer to subscribe, you can start to see their spending and consumption habits. This data is the ultimate in market research. It’s how Netflix knows which new shows to produce and which to kibosh.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article7": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2019/03/The-Big-Thing-Holding-Back-Small-Businesses-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"The Big Thing Holding Back Small Businesses",
        "textList":"Small businesses stay small either by choice, or because they start chasing growth in the wrong places.,When you strip away the layers, it all comes down to darts.,Imagine a dart board with a bull’s eye and around it is a series of wider and wider circles. The bull’s eye is where the people just like you hang out. They are the people (or businesses) who feel the problem your company set out to solve. They are usually your first customers and raving fans.,The further you go outside of your bull’s eye, the less these prospects feel your exact pain.,Why do entrepreneurs go outside their bull’s eye? When you’re a self-funded start-up, you’re scrambling — just trying to bootstrap your way to a company. You don’t have a lot of money to invest in formal marketing, so you rely on word-of-mouth and referrals, which also means you’re often talking to people outside of your bull’s eye.,These prospects may experience the problem you’re trying to solve, but they are slightly different (that’s why they’re not in the bull’s eye). They like your product or service but want a little tweak to it: a customization or a different version. You don’t see the harm in making a change and start to adjust your offering to accommodate the customers outside your bull’s eye.,Your new (slightly-outside-the-bull’s-eye) customer tells her friends about how great you are, and how willing you are to listen to your customers, and she refers a prospect even further outside your bull’s eye who again, asks you for another tweak.,Making these changes to your original product or service to accommodate customers outside your bull’s eye seems innocent enough at the time, but eventually, it undermines your growth.,Why?,To grow a business beyond your efforts, you need to hire employees (or build technology) that can do the work. As humans, we are usually lousy at doing something for the first time, but can master most things with enough repetition.,Think about teaching a toddler how to tie his shoes. The first few attempts are usually rough. It’s a new skill and their tiny hands have never had to make bunny ears before. You break it down for the child and show them how to master each step. It can take weeks, but eventually they get it. As adults, we don’t even think about tying our shoes — we’ve mastered the skill by repetition.,The same is true of your employees. They need time to truly master the delivery or your product or service. Every time you make a tweak for a new customer outside your bull’s eye, it’s like changing the instructions on tying your shoe laces. It’s disorienting for everyone and leads to substandard products and services, which customers receive and are less than enthusiastic about.,Having unhappy customers often leads the owner to step in and “fix” the problem. While some founders can indeed create the customized product or service for their new, outside-the-bull’s-eye customer, they are making their company reliant on them in the process.,A business reliant on its founder will stall out at a handful of employees when the founder runs out of hours in the day.,The secret to avoiding this plateau, and continuing to grow, is to be brutally disciplined in only serving customers in your bull’s eye for much longer than it feels natural. When you want to grow, the temptation is to take whatever revenue you can, but the kind of growth that comes from serving customers outside your bull’s eye can be a dead end.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article8": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2019/01/The-One-Number-Owners-Need-to-Stop-Focusing-On-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"The One Number Owners Need to Stop Focusing On",
        "textList":"The value of your business comes down to a single equation: what multiple of your profit is an acquirer willing to pay for your company?,profit × multiple = value,Most owners believe the best way to improve the value of their company is to make more profit – so, they find ways to sell more and more. As experts in their industry, it’s natural that customers want to personally engage with them, which means spending more time on the phones, on the road and face-to-face to increase sales.,With this model, a company can slightly grow, but the owner’s life becomes much more difficult: customers demand more time and service, employees begin to burn out, and soon it feels like there are not enough hours in the day. Revenue flat lines, health can suffer and relationships get strained – all from working too much. Does this feel familiar?,If you’re spending too much time and effort on increasing your profit, you could find yourself diminishing the overall value of your business. The solution? Focus on driving your multiple (the other number in the equation above). Driving your multiple will ultimately help you grow your company value, improve your profit and redeem your freedom.,What Drives Your Multiple,Differentiated Market Position,Acquirers only buy what they could not easily create, so expect to be paid more if you have close to a monopoly on what you sell and/or are one of the few companies who have been licensed to provide the specific product or service in your market.,Lots of Runway,Most founders think market share is something to strive for, but in the eyes of an acquirer, it can decrease the value of your business because you’ve already sopped up most of the opportunity.,Recurring Revenue,An acquirer is going to want to know how your business will do once you leave – recurring revenue assures them that there will still be a business once the founder hits eject.,Financials,The size and profitability of your company will matter to investors. So will the quality of your bookkeeping., ,The You Factor,The most valuable businesses can thrive without their owners. The inverse is also true because the most valuable businesses are masters of independence.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article9": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/12/THESUR1.jpg",
        "title":"The Surprising Way Companies Like Netflix and Amazon Conduct Market Research",
        "textList":"Companies like Netflix, UrthBox, and Amazon are leveraging the subscription business model to discover what their customers want next.,In a traditional business, the customer buys your product or service once, and it is up to you to try to convince them to buy again in the future. You often have no idea if they liked what they bought and what would have made them buy more, so you’re left having to guess or invest in costly market research.,In a subscription business, you have “automatic customers” who agree to purchase from you into the future, as long as you keep providing your service or product.,Long-term, direct relationship,Unlike a transactional business model, subscribers are opting into a long-term, direct relationship with you. You know who your customers are and which of your products and services they use, so you have a much better understanding of their preferences than an industry competitor relying on a traditional business model.,A subscription business gives you a direct relationship with your customers and an ability to track their preferences in real time. It’s how Netflix knows which television series to produce next and how Amazon figures out what products their Prime subscribers are dreaming of buying next.,But you don’t have to be a sophisticated media giant or billion-dollar e-tailer to track customer preferences through the subscription model. Look at subscription-based ContractorSelling.com, run by Joe Crisara. In return for a fee of $89 per month, you can subscribe and get information, tips, and advice on how to run a successful contracting business. Plumbers and electricians subscribe to ContractorSelling.com for Crisara’s insight, and as they start to read articles and contribute to the forums, Crisara can see what’s on his subscribers’ minds.,That’s important because Crisara also makes money from conferences. Seeing which articles are most popular and controversial among his members gives Crisara insight that helps when he’s picking speakers and topics for his live events.,UrthBox,For $20 a month, UrthBox offers a monthly selection of hand-picked, natural, GMO-free goods to try. UrthBox asks subscribers what they think of the products in each box and rewards them when they respond or refer a friend. Each referral earns points that the subscriber can then use in the online store.,UrthBox then offers the manufacturers of the samples a custom online portal where marketers can see how UrthBox subscribers rated each product. UrthBox uses the data to select merchandise for its online store and prominently displays the products customers like best.,One of the hidden benefits of turning customers into subscribers is the ongoing, direct nature of a subscription relationship, which means you can watch and ask your customers for feedback, ensuring they stay subscribers and buy more over time.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article10": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/12/Creating-Sticky-Customers-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Creating Sticky Customers",
        "textList":"Repeat customers are the lifeblood of your business, but customers can be fickle. Here’s how to make them sticky.,In a traditional business, the customer buys your product or service once, and it is up to you to try to convince them to buy again in the future. However, in a subscription business, you have what is called an “automatic customer” who agrees to purchase from you in the future, as long as you keep providing your service or product.,Feeding Rover Automatically,One of the reasons subscribers are such attractive customers is that, once they subscribe, they become less price-sensitive. To illustrate, imagine you live in England and own a 100-pound Pyrenean Mountain Dog that eats two hearty bowls of dog food a day. Feeding the love of your life is an expensive proposition, so you’re always on the lookout for a deal on dog food. Once every two weeks, you trudge down to the local pet supply store and cart a case of kibble home. In the meantime, if you see dog food on sale at your local grocery store, you’ll buy it. If you get a coupon for a buy-one-get-one-free offer from another store, you’ll take advantage of it.,Eventually, you get tired of last-minute trips to the store, so you subscribe to Warwickshire, UK-based petshop.co.uk, which offers a “Bottomless Bowl” subscription service. Now you know you’re going to get a shipment of dog food every fortnight, and the part of your brain that scans the flyers for dog food starts to shut down, knowing that the convenience of having dog food shipped automatically far outweighs saving a few dollars on kibble.,Integration Drives Stickiness,Beyond the simple convenience of automatic service, subscribers become even more loyal when they start to integrate their subscriptions into their daily lives. Subscribers knowingly enter into an agreement in which the convenience of uninterrupted, automatic service is exchanged for their future loyalty. Rather than buying once without returning, subscribers stick around—hopefully for years, which is why subscribers drive up the value of your company so dramatically.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article11": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/09/The-Biggest-Mistake-Owners-Make-When-Selling-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"The Biggest Mistake Owners Make When Selling",
        "textList":"One of the biggest mistake owners make in selling their company is being lured into a proprietary deal.,The Definition of a Proprietary Deal,Acquirers land a proprietary deal (or “prop deal”) when they convince owners to sell their businesses without creating a competitive marketplace. Acquirers running a proprietary deal know they don’t have any competition and tend to make weaker offers with more punitive terms because they know nobody else is bidding.,Many founders become the target of a proprietary deal without even knowing they have been duped. First, someone senior from the acquiring company approaches the founder, complimenting them on their business. The acquirer suggests lunch, and then high-level financials are exchanged. Soon, the owner starts going down a path that is difficult to come back from.,As the parties in a proprietary deal get to know one another, founders often share information with the acquirer that puts them in a compromised negotiation position. The interactions are set up as friendly exchanges between two industry leaders, but many founders reveal key facts in these discussions that end up being used against them when negotiations turn serious. Business owners also become more emotionally committed to selling the more resources they invest in the process and the more time they spend thinking—perhaps dreaming—of what it would mean to sell their business.,How to Avoid Getting Taken In By a Proprietary Deal,Savvy sellers avoid the proprietary deal by creating a competitive process for their company. Take for example Dan Martell, the founder of Clarity.fm, among other companies. When Martell decided to sell Clarity, he knew the likely buyer was one of five New York-based companies. Instead of negotiating with one, he invited all five to an event he hosted in New York. The five CEOs—all of whom knew one another—saw a room full of their competitors and realized that if Clarity went on the market, they would have to out-bid the other buyers in that room.,Hosting the event was Martell’s way of communicating to all the potential buyers that a proprietary deal was off the table and that if they wanted to buy Clarity, they would have to compete for it.,It’s flattering to receive a call from an executive at a company you respect. Just know that if you accept their invitation of lunch, you run the risk of becoming the latest casualty of the proprietary deal.,Not every owner will know in advance the five most strategic buyer prospects for his company, or be able to host them all in the same location. A more universal strategy—and one more sure of success (unless you have repeated experience in selling companies) is this: engage a professional advisor (broker, M&A advisor, or investment banker) before approaching any buyers, or negotiating with any buyers who approach you.,Your company will be professionally prepared for market—with an extensive Confidential Information Memorandum and other marketing materials, and having your financial and company information carefully reviewed and presented in its best light. Then—when buyers are approached by your advisor—they will understand immediately that you are fully prepared to market your company to the full universe of buyer prospects, and that they must put forward their highest and best offer, if they hope to be selected for a proprietary negotiation.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
        
       },
       "article12": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/10/Exiting-Tips-from-One-of-The-Top-40-Under-40-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Exiting Tips from One of The Top 40 Under 40",
        "textList":"Wind Mobile founder Anthony Lacavera has started 12 businesses, six of which he has exited. His exits have ranged in value from the $6 million he got for one of his recent start-ups to $1.3 billion when he sold Wind Mobile. He did it by following two key tips.,Lacavera has owned hyper-growth unicorns and lifestyle businesses and urges entrepreneurs to be clear about their long-term prospects. Lacavera started a business supplying hotels with internet access and understood the company would be a good cash generator, but would never sell for a mint. He ran the business for almost two decades and used the cash it generated to fund various other ventures. Recently, he finally sold the business, which was generating $1.5 million in pre-tax profit, for $8 million—a relatively modest 5 times earnings, which was fine by Lacavera, because it had served its purpose of funding other companies along the way.,Lacavera encourages entrepreneurs to separate the role of CEO and business owner. Even though they may be the same person, they have different functions and, at some point, your business may be better served by separating the two roles. Entrepreneurs who are comfortable handing the reins to a professional manager may do better in the long run than those who need to control everything.,Lacavera had great success, which is visible in the fact that he has won just about every business award there is, including 2010 CEO of the Year, Top 40 Under 40, Deloitte Technology Fast 50, and Canada’s Fastest Growing Company. One of the top secrets to Lacavera’s success — knowing when to bring in a CEO to replace himself in any of his ventures.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article13": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/07/The-Buy-versus-Build-Equation-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"The Buy vs. Build Equation",
        "textList":"If you’re wondering what your business might be worth to an acquirer, there is a simple calculation you can use.,Let’s call it “The Build vs. Buy Equation”.,At some point, every acquirer does the math and calculates how much it would cost to re-create what you’ve built. If an acquirer figures they could buy your business for less than they would spend on both the hard and soft costs of re-deploying their employees to build a competitive product, then they will be inclined to acquire yours. If they think it would be less costly to create it themselves, they are likely to choose to compete instead.,The key to ensuring that what you have is difficult to replicate is focusing on a single product or service and building on your competitive point of differentiation. When you create a product that is unique and pour all of your resources into continuing to differentiate it from the pack, you can dictate terms, because re-creating your business becomes harder the more you focus on one thing.,The worst strategy is to offer a wide range of services and products only loosely differentiated from others on the market. Any acquirer will rightly assume they can set up shop to compete with you by simply undercutting your prices for a period of time and driving you out of business.,C-Labs Focuses On Building an Irresistible Product,Chris Muench started C-Labs in 2008 to go after the burgeoning opportunities presented by the Internet-of-Things (IOT). He began by writing custom software applications that allowed one machine to talk to another. In 2014, he got the industrial giant TRUMPF International to acquire 30% of C-Labs, which gave him the cash to transform his service offering into a single product.,By the end of 2016, Muench’s product was showing early signs of gaining traction but C-Labs was running out of money.,In the end, TRUMPF acquired C-Labs in a seven-figure deal that could stretch to eight figures if Muench is successful in hitting his future targets. Why would a large, sophisticated company like TRUMPF acquire an early-stage business like C-Labs? Because they knew that re-creating Muench’s technology would cost much more than simply writing a seven-figure check to buy it outright.,In other words, TRUMPF used The Build vs. Buy Equation and realized that buying C-Labs was cheaper than trying to reproduce it.,Selling too many undifferentiated products or services is a recipe for building a business that—if it is sellable at all—will trade at a discount to its industry peers. By contrast, the trick to getting a premium for your business is having a product or service that is irresistible to an acquirer, yet difficult for them to replicate.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article14": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/03/How-to-Lure-a-Giant-Like-Facebook-into-Buying-Your-Company-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"How to Lure a Giant Like Facebook into Buying Your Company",
        "textList":"A great business is bought, not sold, so, if you look too eager to sell your business, you’ll be negotiating on the back foot and look desperate—a recipe for a bad exit.,But, what if you really want to sell? Maybe you’ve got a new idea for a business you want to start or your health is suffering. Then what?,As with many things in life, the secret may be a simple tweak in your vocabulary. Instead of approaching an acquirer to see if they would be interested in buying your business, approach the same company with an offer to partner with them.,Entering into a partnership discussion with a would-be acquirer is a great way for them to discover your strategic assets, because most partnership discussions start with a summary of each company’s strengths and future objectives. As you reveal your aspirations to one another, a savvy buyer will often realize there is more to be gained from simply buying your business than partnering with it.,Facebook Buys Ozlo,For example, look at how Charles Jolley played the sale of Ozlo, the company he created to make a better digital assistant. The market for digital assistants is booming. Apple has Siri, Amazon has Alexa and the Google Home device now has Google Assistant built right in.,Jolley started Ozlo with the vision of building a better digital assistant. By 2016, he believed Ozlo had technology superior to that of Apple, Amazon or Google. Realizing his technology needed a big company to distribute it, he started to think about potential acquirers. He developed a long list, but instead of approaching them to buy Ozlo, he suggested they consider partnering with him to distribute Ozlo.,He met with many of the brand-name technology companies in Silicon Valley, including Facebook, which wanted a better digital assistant embedded within its messaging platform. They took a meeting with Jolley under the guise of a potential partnership, but the conversation quickly moved from “partnering with” to “acquiring” Ozlo.,Jolley then approached his other potential partners indicating his conversations with Facebook had moved in a different direction and that he would be entering acquisition talks with Facebook. Hearing Facebook wanted the technology for themselves, some of Jolley’s other potential “partners” also joined the bidding war to acquire Ozlo.,After a competitive process, Facebook offered Jolley a deal he couldn’t refuse, and they closed on a deal in July 2017. Jolley got the deal he wanted in part because he was negotiating from the position of a strong potential partner, rather than a desperate owner just looking to sell.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article15": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/08/The-Anatomy-of-a-Successful-Exit-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"The Anatomy of a Successful Exit",
        "textList":"Stephanie Breedlove started Breedlove & Associates in 1992 as a way to pay her nanny. The big payroll processors weren’t interested in dealing with one person’s wages and doing it themselves was complicated and time-consuming, too much for the then overwhelmed Breedloves.,Breedlove saw a business opportunity and started a payroll company for parents who needed to pay their nannies. By 2012, Breedlove & Associates had grown to $9MM in revenue and then she received a $54MM acquisition offer.,To give you some context of how incredible it is to sell a $9MM business for $54MM let’s look at the numbers. At The Value Builder System™, more than 25,000 business owners have completed the Value Builder Score questionnaire, part of which asks about any acquisition offers they may have received. The average multiple offered is 3.76 times pre-tax profit. Even the best-performing businesses, those with a Value Builder Score of 80+, only get offers of 6.27 times pre-tax profit on average. Breedlove got close to six times revenue.,What did Breedlove do right? We’re going to look at the five things Breedlove did—and that you can do—to drive up the value of a business.,1. Sell Less Stuff to More People,When Breedlove hit $30K per month in revenue, she quit her job at Accenture (formerly Anderson Consulting) and devoted herself to Breedlove & Associates full-time. To grow, she had a choice: sell more to her existing customers (e.g. busy couples often need lawn-care, house-cleaning, or grocery-delivery services) or stick with her niche of paying nannies. Most consultants and experts would say it’s easier to sell more to existing customers (and they’re right), but it doesn’t make your business more valuable. Breedlove decided to stick to her niche and find more parents who needed to pay their nannies, and that decision laid the foundation for a more valuable business.,Investors like Warren Buffet look for companies with a deep and wide competitive moat that gives the owner pricing authority. When you have a differentiated product or service, we call it having The Monopoly Control and companies with a monopoly get significantly higher acquisition offers.,Rather than selling existing customers generic services in commoditized markets, Breedlove focused on selling one thing to as many customers as she could find.,2. Strive for 50%+ Net Promoter Score,One feature that interested acquirers look for is your customer satisfaction levels. Increasingly, they are turning to the Net Promoter Score (NPS) as a measure of this. NPS was developed by Fred Reichheld and his team at Satmetrix, who discovered that your customers’ willingness to refer you to their friends or colleagues is highly predictive of your company’s future growth rate.,The NPS approach is to ask your customers how willing they would be to refer your company to a friend or colleague, on a scale of 0 to 10. They are then categorized into Promoters (9s and 10s), Passives (7s and 8s) or Detractors (0–6s). The NPS is calculated by subtracting the percentage of Promoters from the percentage of Detractors. Most businesses achieve an NPS of 10% to 15%, while the very best companies (think Apple and Amazon) get scores of 50% or more.,Breedlove obsessed over her company’s NPS and realized the key to driving it up was perfecting the first few interactions with a new customer. When you call a big payroll company looking for a service to pay your nanny, the response can be underwhelming. With only one person to pay, you are often relegated to the most junior staff member and even they would rather be dealing with a larger client.,When you call Breedlove, by contrast, you get a team of professionals totally focused on setting you up. You’re not an afterthought. You’re not passed on. Instead, you get the best onboarding talent the company has to offer.,This set-up team was a big part of how Breedlove achieved an astonishing 78% NPS.,3. Create Recurring Revenue Streams,The third thing that made Breedlove’s company attractive was recurring revenue.,Regardless of what industry you’re in, recurring revenue models give acquirers more confidence that the business will keep going strong after you leave.,By 2012, Breedlove & Associates had grown to $9MM and, given the nature of the payroll business, 100% of their revenue was recurring.,4. Reduce Reliance on Customers, Employees and Suppliers,Breedlove’s company was also attractive to buyers because she had a highly diversified customer base with no single customer representing even close to 1% of her revenue. If more than 10% to 15% of your revenue comes from one buyer, you can expect prospective acquirers to ask a lot more questions.,Customer concentration is one of three factors that make up The Switzerland Structure Module. The Switzerland Structure measures your business’ dependence on a single customer, employee or supplier.,5. Find and Acquirer You Can Help Grow,By 2012, Breedlove & Associates was growing 17% per year, which is good but not blow-your-mind good. So how did she attract such an incredible acquisition offer? The trick was showing her acquirer how they could grow.,In Breedlove’s case, she sold her company to Care.com. Think of Care.com as the Angie’s List of care providers (e.g. child care, senior care, etc.). If you need someone to care for your kids or an elderly relative, you enter your address into their website and Care.com will give you a list of vetted caregivers in your area.,At the time of the acquisition, Breedlove had 10,000 customers and Care.com had seven million members. Breedlove argued that if just 1% of Care.com’s members used Breedlove’s payroll service, it would equate to 7X growth in Breedlove & Associates almost overnight.,In 2012, Care.com acquired Breedlove & Associates for $54MM—an outstanding exit made possible by Breedlove’s focus on what drove her company’s value, not just their top-line revenue.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article16": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/01/ONETWE1.jpg",
        "title":"One Tweak That Can (Instantly) Add Millions to the Value of Your Business",
        "textList":"If you’re trying to figure out what your business might be worth, it’s helpful to consider what acquirers are paying for companies like yours these days.,A little internet research will probably reveal that a business like yours trades for a multiple of your pre-tax profit, which is Sellers Discretionary Earnings (SDE) for a small business and Earnings Before Interest Taxes, Depreciation and Amortization (EBITDA) for a slightly larger business.,Obsessing Over Your Multiple,This multiple can transfix entrepreneurs. Many owners want to know their multiple and how they can jack it up. After all, if your business has $500,000 in profit, and it trades for four times profit, it’s worth $2 million; if the same business trades for eight times profit, it’s worth $4 million.,Obviously, your multiple will have a profound impact on the haul you take from the sale of your business, but there is another number worthy of your consideration as well: the number your multiple is multiplying.,How Profitability is Open to Interpretation,Most entrepreneurs think of profit as an objective measure, calculated by an accountant, but when it comes to the sale of your business, profit is far from objective. Your profit will go through a set of “adjustments” designed to estimate how profitable your business will be under a new owner.,This process of adjusting—and how you defend these adjustments to an acquirer—is where you can dramatically spike your company’s value.,Let’s take a simple example to illustrate. Imagine you run a company with $3 million in revenue and you pay yourself a salary of $200,000 a year. Further, let’s assume you could get a competent manager to run your business as a division of an acquirer for $100,000 per year. You could safely make the case to an acquirer that under their ownership, your business would generate an extra $100,000 in profit. If they are paying you five times profit for your business, that one adjustment has the potential to earn you an extra $500,000.,You should be able to make a case for several adjustments that will boost your profit and, by extension, the value of your business. This is more art than science, and you need to be prepared to defend your case for each adjustment. It is important that you make a good case for how profitable your business will be in the hands of an acquirer.,Some of the most common adjustments relate to rent (common if you own the building your company operates from and your company is paying higher-than-market rent), start–up costs, one-off lawsuits or insurance claims and one-time professional services fees.,Your multiple is important, but the subjective art of adjusting your EBITDA is where a lot of extra money can be made when selling your business—and that is precisely where a professional M&A Advisor can be invaluable at getting you the highest price available in the market. Experienced advisors will help you to discover and calculate favorable adjustments, while understanding exactly which adjustments can be convincing to a buyer, versus those that will be rejected and will also undermine your credibility as a seller.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article17": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/04/Successful-Entrepreneurs-Can-Be-the-Doer-and-the-Dealmaker-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Successful Entrepreneurs Can Be the Doer and the Dealmaker",
        "textList":"Where do you sit on the doer vs. dealmaker continuum? On one hand, you have business owners who are really good operators. They have a plan, know their numbers and work that plan. They look for small improvements every day and hesitate to entertain new strategies because they know what works.,On the other end of the spectrum, you have the dealmakers. They quickly bore of the doing and are constantly on the prowl for the next big idea. They are always on the lookout for a business they can buy, a new concept they can negotiate the rights for or a partnership they can forge.,Some of the most successful entrepreneurs can be equally good at being both doers and dealmakers, and most business owners have a little bit of both personalities, with a tendency to tilt in one direction or the other. However, problems occur when you lean too far in one direction.,Let’s take for example, U.K.-based Jonathan Jay, a twenty-year veteran of the start-up world. Jay got his start publishing magazines, but quickly wanted out, and he sold his publishing company by the age of 27. He then started a coach-training business which competed with one other provider. His competitor ran into trouble and Jay decided to buy his business after less than a week of diligence. Jay then sold the combined entity for a seven-figure payday.,Bored after a week or two of retirement, Jay started a digital marketing company. He found client acquisition a challenge, so he partnered with a marketing guru who had a pre-existing following of customers. Jay gave his new partner 50% of his company in exchange for access to the marketing guru’s list, but he skimped on writing the partnership agreement because he was resentful of the legal bills he was paying to defend an unrelated claim.,Soon after merging, the partners fell out and Jay had to wrestle his shares back without the help of a formal partnership agreement. Unbowed by partnerships, he then found another distressed marketing agency to buy, which he did by assuming its debt and putting virtually nothing down. He put the business into bankruptcy after carving out the one piece that had value and merging it with his marketing company. Within a year of buying the business, he sold the combined entity for another seven-figure exit.,Jay’s story is exhausting. It’s a high-wire act of high-stakes negotiation, success, mistakes and eventual triumph. You can’t help but wonder if he would have been even more successful—and a lot less stressed—if he had been a little more of a doer and little less of a dealmaker.,Whether you are more dealmaker or doer, it’s worth asking yourself whether you’re tilting too far in one direction.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article18": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2018/05/Growing-Fast-Here’s-What’s-Likely-To-Kill-Your-Company-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Growing Fast? Here’s What’s Likely To Kill Your Company",
        "textList":"If your goal is to grow your business fast, you need a positive cash flow cycle or the ability to raise money at a feverish pace. Anything less and you will quickly grow yourself out of business.,A positive cash flow cycle simply means you get paid before you have to pay others. A negative cash flow cycle is the direct opposite: you have pay out before your money comes in.,A lifestyle business with good margins can often get away with a negative cash flow cycle, but a growth-oriented business can’t, and it will quickly grow itself bankrupt.,Growing Yourself Bankrupt,To illustrate, take a look at the fatal decision made by Shelley Rogers, who decided to scale a business with a negative cash flow cycle. Rogers started Admincomm Warehousing to help companies recycle their old technology. Rogers purchased old phone systems and computer monitors for pennies on the dollar and sold them to recyclers who dismantled the technology down to its raw materials and sold off the base metals.,In the beginning, Rogers had a positive cash flow cycle. Admincomm would secure the rights to a lot of old gear and invite a group of Chinese recyclers to fly to Calgary to bid on the equipment. If they liked what they saw, the recyclers would be asked to pay in full before they flew home. Then Rogers would organize a shipping container to send the materials to China and pay her suppliers 30 to 60 days later.,In a world hungry for resources, the business model worked and Rogers built a nice lifestyle company with fat margins. That’s when she became aware of the environmental impact of the companies she was selling to as they poisoned the air in the developing world burning the plastic covers off computer gear to get at the base metals it contained. Rogers decided to scale up her operation and start recycling the equipment in her home country of Canada, where she could take advantage of a government program that would send her a check if she could prove she had recycled the equipment domestically.,Her new model required an investment in an expensive recycling machine and the adoption of a new cash model. She now had to buy the gear, recycle the materials and then wait to get her money from the government.,The faster she grew, the less cash she had. Eventually, the business failed. ,Rogers Rises from the Ashes with a Positive Cash Flow Model,Rogers learned from the experience and built a new company in the same industry called TopFlight Assets Services. Instead of acquiring old technology, she sold much of it on consignment, allowing her to save cash. Rogers grew TopFlight into a successful enterprise, which she sold in 2013 for six times Earnings Before Interest Taxes Depreciation and Amortization (EBITDA) to CSI Leasing, one of the largest equipment leasing companies in the world.,Rogers got a great multiple for her business in part because of her focus on cash flow. Many owners think cash flow means their profits on a Profit & Loss Statement. While profit is important, acquirers also care deeply about cash flow—the money your business makes (or needs) to run.,The reason is simple: when an acquirer buys your business, they will likely need to finance it. If your business needs constant infusions of cash, an acquirer will have to commit more money to your business. Since investors are all about getting a return on their money, the more they have to invest in your business, the higher the return they expect, forcing them to reduce the original price they pay you.,So, whether your goal is to scale or sell for a premium (or both), having a positive cash flow cycle is a prerequisite.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article19": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/09/5-Reasons-Why-Now-Might-Be-The-Right-Time-To-Sell-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"5 Reasons Why Now Might Be The Right Time To Sell",
        "textList":"Are you trying to time the sale of your business so that you exit when both your business and the economy are peaking?,While your objective to build your company’s value is admirable, here are five reasons why you may want to sell sooner than you might think:,      1. You May Be Choking Your Business,When you start your business, you have nothing to lose, so you risk it all on your idea. But as you grow, you naturally become more conservative, because your business actually becomes worth something. For many of us, our company is our largest asset, so the idea of losing it on a new growth idea becomes less attractive. We become more conservative and hinder our company’s growth.,      2. Money Is Cheap,We’re coming into a period of ultra-low interest rates. Financial buyers will likely borrow money to buy your business so—at the risk of over simplifying a lot of MBA math—the less it costs them to borrow, the more they will spend to buy your business.,      3. Timing Your Sale Is A Fool’s Errand,The costs of most financial assets are correlated, which is to say that the value of your private business, real estate and a Fortune 500 company’s stock all move in roughly the same direction. It’s notoriously difficult to call a “market top.” Even if you have the great good luck to do so, the problem is, you’ll have to do something with the money you make from the sale of your company, which means you will likely buy into a new asset class at the same frothy valuation as you are exiting at.,      4. Cybercrime,If you have moved your customer data into the cloud, it is only a matter of time before you become the target of cybercrime. Randy Ambrosie, the former CEO of 3Macs, a Montreal-based investment company that manages $6 billion for wealthy Canadian families decided to sell in part because he feared a cyber attack. Ambrosie and his partners realized they had been under-investing in technology for years, at a time when cybercrime was becoming more prevalent in the financial services space. Ambrosie decided to sell his firm to Raymond James because he realized the cost for staying ahead of hackers was becoming too much to bear.,      5. There Is No Corporate Ladder,In most occupations, the ambitious must climb the ladder. Aspiring CEOs must methodically move up, stacking one job on the next until they are ready for the top post. They have to put in the time, play the right politics and succeed at each new assignment to be considered for the next rung.,By choosing a career as an entrepreneur, you get to skip the ladder entirely. You can start a business, sell it, take a sabbatical and start another business and nobody will miss you on the ladder. Your second (or third) business is likely to be more successful than your first, so the sooner you sell your existing business, the sooner you get to take a break and then start working on your next.,It can be tempting to want to time the sale of your business so that the economy and your company are peaking, but in reality, it may be better to sell sooner rather than later.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article20": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/10/MAXIMI2.jpg",
        "title":"Maximizing the Sale of Your Company: Building Business Value",
        "textList":"Business owners planning a sale have a unique opportunity. Larger entities often have plenty of cash available for purchases. To take advantage of these opportunities, business owners must be prepared. Here are the considerations that can increase the sales value of your business.,Current Sales Environment,The last decade has been difficult for many owners. Some are exhausted, and want to liquidate so they can transition to something else. Others have done well, but have no one in a position to buy or run the business.,With globalization, the process of selling a business has become more complex. Companies can thrive and fail at a more rapid clip. But also the pool of potential buyers has increased. Unfamiliarity with the sales process disadvantages owners, spurring some to sale at a price lower than they should.,Many fail to plan for a transition, and may want to sell before the business’s value is maximized. This lowers sales value.,Your goal should be to position your business for optimal success within the confines of the current market. Sales and growth never continue indefinitely, so your planning strategy must include an honest evaluation of the market.,Incrementally Building Value,Many owners view their businesses as more valuable than they are. An objective advisor offers much-needed perspective that can help you incrementally build value. Some key drivers of value include:,To increase value drivers, you’ll need a timeline of at least two years. Some buyers want an owner and management team to manage the transition, so be prepared. What’s more, cosmetic issues can drive down value, but are often easily corrected.,Some areas of value upon which to focus include:,Existing customer relationships and company culture are critical areas for adding value. If the business is solid, employees must be willing to accept the new buyer, including the culture that buyer brings. Customers and employees often have negative perceptions of change, but high performance can improve these perceptions.,Maximizing Sale Proceeds,Following a few years of value optimization, business worth should increase. This can yield a higher sales price, and maximizes the amount of wealth you can transfer from your business. When you make an agreement regarding purchase prices, the value you’ve added will stand up to due diligence if you’ve properly prepared.,Continued owner involvement with the business is key to the ongoing development of a strong leadership team. It’s even more important when earnouts are incorporated into a sale price. Stipulations tied to revenue and profits may also be included in the purchase contract to obtain the full price.,You may see your company as part of the family, or perhaps even an extension of yourself. To a buyer, your business is an investment. By seeing things from their perspective, you can begin maximizing value well ahead of any sale. That means better growth for your business and, following a successful sale, more wealth for you.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article21": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/11/THEDIF1.jpg",
        "title":"The Difference Between Business Brokers, M&A Advisors, and Investment Bankers",
        "textList":"When selling your business, you need a knowledgeable, expert advisor. You only get one chance to sell, so the wrong advisor could cost a part of your retirement. These intermediaries are often called mergers and acquisitions (M&A) advisors, business brokers, or investment bankers.,All business sales advisors have a common goal: managing the sale process by evaluating and marketing your business, negotiating the deal, and ensuring the transaction closes. The approach varies with the size of the business and the type of expert retained. Because each type of advisor specializes in a specific portion of market, you should seek an intermediary who fits the needs of your business.,Business Brokers,Business Brokers typically work with companies that have under $10 million in annual revenues. These “main street” businesses are often local service providers, such as restaurants, convenience stores, dry cleaners, and other small businesses in which the owner will likely become the owner-operator.,These projects typically yield lower fees, so brokers often handle numerous engagements—often as many as 10 sales at a time. For this reason, they can only offer limited attention, and their marketing strategy may be limited to posting the listing on various sites. Their expertise varies, and may be limited, since the fees earned in this position are often lower. Even some commercial real estate agents sometimes offer business brokerage services.,M&A Advisors,M&A intermediaries or advisors work with business owners with revenues between $10 million and $100 million. These professionals know how to attract private equity firms and strategic buyers, as well as individuals of high net worth. They are familiar with a range of financing options to facilitate complex capital structures.,M&A advisors limit themselves to one to two engagements at a given time. This enables them to offer in-depth analysis and marketing advice, and to spend significant time with each client.,Larger deals are often complex, so M&A intermediaries often work with a team of advisors, including accountants, financial analysts, and attorneys. This deal team works together to ensure a successful sale. M&A advisors typically charge a retainer fee to compensate themselves for the massive work involved in evaluating the business and marketing it. However, the best advisors collect the bulk of their fees following a successful sale. This fee usually follows a scaled percentage formula.,Investment Bankers,Investment bankers serve clients in mid to upper-level markets, working with owners of public and private businesses with annual revenues in excess of $100 million. These firms network with businesses and private equity groups seeking to acquire larger companies. Though knowledgeable, they often can’t tap a network of buyers seeking to acquire smaller entities.,Investment bankers offer strategic M&A advice, in addition to helping clients raise debt and equity capital, refinance, and recapitalize. Their fees vary and are negotiable.,Conclusion,The right intermediary is a key player in a business sale. It’s important to interview several before retaining an intermediary. An experienced broker who sells ice cream shops might have no idea how to handle a manufacturing, construction, or distribution business. The right intermediary has experience in your industry, and is a good fit for your unique needs.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article22": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/07/How-to-Find-the-Perfect-Buyer-for-Your-Business-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"How to Find the Perfect Buyer for Your Business",
        "textList":" ,Strategic buyers tend to pay the most because they have a clearly identified need.,Financial Buyers\\nFinancial buyers are typically professional investors, though they come in many packages: investment partnerships, private equity firms, hedge funds, and many others. These buyers are concerned with hidden value and cash flow. To them, your business is a cash stream, and will be most attractive when it’s available at a low price.,Some financial buyers want the owner to continue running the business. This happens when they purchase at a low price, but believe they may be able to sell for more in the future. Financial buyers are aggressive negotiators who want a rock bottom price.,Operational Buyers\\nOperator buyers are like you. They want to run a business that succeeds. Their goal is to purchase your business, run it, and earn more money so they can enjoy a comfortable life. Sometimes these buyers are highly inexperienced, with unrealistic expectations of a career or life change. They may need significant assistance to manage the sale and run the business. They can be fickle, and may have difficulty securing financing. This can make these transactions a financial risk.,Operators are less skilled at negotiations. They also have more limited resources, which can significantly alter the negotiation process and timetable.,Ranking Buyer Options\\nThere is no “right” buyer for every business, or even for every type of business. Instead, owner-operators need to know the available options, then understand how those options will affect the process of the sale, as well as its value. Consider ranking each type of buyer based on how they see you. Consider which is most and least attractive to you about each type of buyer. Then look at what’s actually available. If no financial buyers wish to purchase your business, for example, it doesn’t matter if that’s the most attractive option for your needs. Go with your next best option. Continue evaluating your ranking of each buyer type until you have a potential buyer. Your experience with that buyer may further refine your assessment of what will be most valuable to you in a sale.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article23": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/10/5-Lessons-from-Home-Depot’s-Acquisition-of-Blinds-dot-com-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"5 Lessons from Home Depot’s Acquisition of Blinds.com",
        "textList":"Jay Steinfeld built Blinds.com into a $100 million e-tailer before selling out to Home Depot. Here are five things that made it a spectacular exit.,Win The Make vs. Buy Battle,Companies like Home Depot have a “make or buy” decision when they see a competitor winning market share. They can opt to buy the competitor or choose to simply re-create what they have built.,An acquirer will likely opt to buy your company if you are so dominant in your niche that recreating what you have built would take too long and cost more than acquiring it from you.,Blinds.com got acquired, in part, because they were a big fish in a small pond. At more than $100 million in revenue, they were the largest online retailer of blinds in America by a long shot. Even though Home Depot has close to $90 billion in sales, Blinds.com were outperforming them in their tiny niche and that made Blinds.com irresistible to Home Depot.,Run It Like It’s Public,At the time of the Home Depot acquisition, Blinds.com had 175 employees, yet Steinfeld had been running the company as if it were public for years. He had put together a top-drawer management team and taken the unusual step of assembling an outside board of directors. He had quarterly board meetings with formal presentation decks, and Steinfeld hired a Big Four firm to complete a full audit of his financials each year.,Steinfeld credits this rigorous approach to running a relatively small company as a major reason Home Depot was interested in Blinds.com and able to close on the acquisition so quickly.,Keep Most Of The Equity,Steinfeld invested $3,000 of his own money into a basic online presence for his blinds store back in 1993 and grew Blinds.com to more than $100 million in sales without diluting himself by taking three or four rounds of institutional investment, as would be typical of an internet start-up. Steinfeld took a small investment from friends and family and used bank debt to help him buy distressed companies for pennies on the dollar. It wasn’t until 2012—almost 20 years after starting the business—that he accepted his first round of “professional” money from a private equity firm who wanted to invest more, but Steinfeld refused, only taking enough to buy out a few of his original investors and pay off some debt.,Keep Investors Aligned,One of the reasons Steinfeld accepted an investment from a private equity group was that he had become misaligned with two of his original investors. The investors saw the success of Blinds.com and wanted Steinfeld to start declaring regular dividends. Steinfeld, by contrast, was focused on building a growth company and needed the cash to fuel his 25% per year growth. After a while, his investor’s expectations got so far out of whack that Steinfeld opted to buy them out.,Share The Love,One of Steinfeld’s best memories is the day he told his employees Home Depot had acquired Blinds.com. Steinfeld had made sure every one of his 175 people had Blinds.com stock options and so stood to gain financially from the sale. Steinfeld went further and gave each employee $2,000 of his own money to start an investment account as a personal thank you for all they had done.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article24": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/06/PREPAR1.jpg",
        "title":"Preparation: The Difference Between Successful and Failed Deals",
        "textList":"Owners often delay plans for a sale until the very time when the sale is least likely to be successful: when they need the money. Others see no need to prepare until they’re ready to sell.,Owners mistakenly believe that, as soon as they’re ready for a sale, buyers will be clamoring for a chance to buy. They see their businesses as inherently valuable—a perception skewed by years of hard work invested in the company.,These CEOs see finding a buying partner as a simple process of eliminating unqualified buyers. They’ll network, locate appropriate buyers, then pick the cream of the crop. Or so they think.,In reality, the sales process is a meandering process that begins well before negotiations. Moreover, there are usually some unexpected changes along the way, including thwarted expectations that demand changed plans.,Selling your business isn’t something you decide to do once. It’s a process that results from months, and possibly years, of work, relationship-building, planning, and adjusting. See the process as a funnel and you’ll better understand. At each stage, the funnel gets a little smaller and the number of potential buyers shrinks.,Each step will also probably take longer than you anticipate. You’ll lose partners as the funnel gets smaller. That’s a good thing, because nearing the end of the funnel means getting closer to closing—and to your ideal deal partner.,If this process is already sounding daunting, you’re not alone. Many business owners simply don’t have the time or expertise to manage the process. The best way to shorten the time line and minimize stress is to work with an investment banker or advisor who is experienced in your industry, who has experience with the outcome (such as raising capital or selling the business) you seek, or both.,A good advisor clarifies your goals at the beginning, then helps you find buyers who may be a good fit. Online platforms may also support the process by helping you form relationships that extend beyond the borders of your region or professional network.,Company performance matters, but so too do external factors like the market. Value drivers you may not see can also affect how widely you need to expand the top portion of your funnel.,Want to complete a transaction according to a desired time line? There’s one thing you must do: Begin early. There’s no such thing as too much planning for a transaction.,A successful sale requires you to strengthen relationships a year, and perhaps two or more years, before the transaction. Consider a goal of two or three new relationships per quarter. This allows you to be more selective about whom you work with, in addition to deepening relationships with potential future partners. You’ll also have more room for error if something goes wrong or you need more time.,This process of advance planning can mean that deal partners drop out before you even begin negotiating. It also makes the time line to a deal a lot more jagged. But it can ultimately shorten the process.,Strategic thinking about the funnel that feeds a deal ensures you have the relationships already in place that can ultimately support a deal. A business transaction is almost always stressful. Advanced preparation, however, removes a significant source of stress from the process, and can support a better deal and a shorter time line to achieving it.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article25": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/08/Why-Now-Is-the-Riskiest-Time-to-Own-Your-Business-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Why Now Is the Riskiest Time to Own Your Business",
        "textList":"Most people think of starting a business as risky, but unless you invest a significant amount of start-up cash in your venture, you’re not really risking much other than your time.,That changes if you’re lucky enough to get your business off the ground. As your company grows, you start to risk more and more of your wealth because the business you’ve built is actually worth something. The longer you hang on to it, the more you have to lose.,This phenomenon makes owners become more risk averse as their business grows, potentially squeezing off growth to avoid risking what they’ve created. This can mean the owner goes from a company’s great asset to its biggest liability.,Cigar City Brewing,For an example of how growth can impact an owner’s appetite for risk, let’s look at the case of Joey Redner, the founder of Florida-based Cigar City Brewing. Redner’s craft beer operation started off in 2009 with the relatively modest goal of selling 5,000 barrels of beer per year.,Cigar City proved popular with the locals and Redner was able to sell 1,000 barrels of beer in his first year of business.,Cigar City Brewing continued to grow but was thirsty for cash, eventually forcing Redner to take on an SBA loan. Redner quickly surpassed his 5,000-barrel goal, and by 2015, had scaled all the way up to 55,000 barrels per year, at which point he ran out of capacity in his brewing facility.,To get to the next level, Redner would have had to find another $20 million for a major expansion, but he was tired of the feeling of being “all in” at the poker table. He had built something successful and wanted to enjoy financial security rather than having to roll his winnings into even more debt that he would have to personally guarantee with the bank.,Redner decided to sell even though his business was still growing and he had built a brand Floridians loved.,And therein lies one of the hidden reasons owners decide to sell. They are tired of shouldering all of the risk. Most of us have a limited appetite for risk, and, as the Bob Dylan song goes, “When you ain’t got nothing, you got nothing to lose.” Start-ups aren’t risking much, but when you build something successful, every day that you decide to keep it is another day you have all (or most) of your chips on the table, and, no matter how strong your hand, eventually we all decide to cash in.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article26": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/07/3WAYST1.jpg",
        "title":"3 Ways to Make Your Company More Valuable Than Your Industry Peers",
        "textList":"Have you ever wondered what determines the value of your business?,Perhaps you’ve heard an industry rule of thumb and assumed that your company will be\\nworth about the same as a similar size company in your industry. However, when we take a\\nlook at the data provided by The Value Builder System™, we’ve found there are eight factors\\nthat drive the value of your business, and they are all potentially more important than the\\nindustry you’re in.,Not convinced? Let’s look at Jill Nelson, who recently sold a majority interest in her $11\\nmillion telephone answering service, Ruby Receptionists, for $38.8 million.,That’s a lot of money for answering the phone on behalf of independent lawyers,\\ncontractors and plumbers across America.,To give you a sense of how high that valuation is, let’s look at some comparison data. At\\nValue Builder, we’ve worked with more than 30,000 businesses in the last five years. Our\\nclients start by completing their Value Builder questionnaire, which covers 35 questions that\\nallow us to place an estimate of value on a company. The average value for companies\\nstarting with us is 3.6 times pre-tax profit and those who graduate our program with a Value\\nBuilder Score of 80+ (out of a possible 100) are getting an average of 6.3 times pre-tax profit.,When we isolate the administrative support industry that Ruby Receptionists operates in,\\nthe average multiple offered for these companies over the last five years is just 1.8 times\\npre-tax profit.,Nelson, by contrast, sold the majority interest in Ruby Receptionists for more than 3 times\\nrevenue.,There were three factors that made Nelson’s business much more valuable than her industry\\npeers, and they are the same things you can focus on to drive up the value of your company:,1. Cultivate Your Point Of Differentiation,Acquirers do not buy what they could easily build themselves. If your main competitive\\nadvantage is price, an acquirer will rightly conclude they can simply set up shop as a\\ncompetitor and win most of your price sensitive customers away by offering a temporary\\ndiscount.,In the case of Ruby Receptionists, Nelson invested heavily in a technology that ensured that\\nno matter when a client received a phone call, her technology would route that call to an\\navailable receptionist. Nelson’s competitors were mostly low-tech mom and pop businesses\\nwho often missed calls when there was a sudden surge of callers. Nelson’s technology could\\nhandle client surges because of the unique routing technology she had built that transferred\\ncalls efficiently across her network of receptionists.,Nelson’s acquirer, a private equity company called Updata Partners, saw the potential of\\napplying Nelson’s call-routing technology to other businesses they owned and were\\nconsidering investing in.,2. Recurring Revenue,Acquirers want to know how your business will perform after they buy it. Nothing gives\\nthem more confidence that your business will continue to thrive post sale than recurring\\nrevenue from subscriptions or service contracts.,In Nelson’s case, Ruby Receptionists billed its customers through recurring contracts—\\nperfect for making a buyer confident that her company has staying power.,3. Customer Diversification,In addition to having customers pay on recurring contracts, the most valuable businesses\\nhave lots of little customers rather than one or two biggies. Most acquirers will balk if any\\none of your customers represents more than 15% of your revenue.,At the time of the acquisition, Ruby Receptionists had 6,000 customers paying an average of\\njust a few hundred dollars per month. Nelson could lose a client or two each month without\\nskipping a beat, which is ideal for reassuring a hesitant buyer that your company’s revenue\\nstream is bulletproof.,Nelson built a valuable company in a relatively unexciting, low-tech industry, proving that\\nhow you run your business is more important than the industry you’re in.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article27": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/05/Increasing-Business-Value-Before-a-Sale-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"Increasing Business Value Before a Sale",
        "textList":"Every business owner sees their business as inherently valuable. But those who truly want to increase value view the business through the lens of a potential buyer. The stronger the business is, the more likely it is to fetch a high price. So how can a seller fortify a business to be the strongest contender in the eyes of a buyer?,Benchmarking\\nFinancial benchmarks compare companies to similarly sized competitors. Databases like Sageworks track thousands of businesses to offer clear benchmarking. Businesses that operate beneath industry averages may have significant liabilities. Benchmarking helps identify these companies, and may offer insight into the source of the problem.,Financial buyers typically look at dozens of businesses a week, using criteria such as deal size, profit, and industry space. Those that don’t meet these initial criteria are immediately discarded. Those that do have already cleared the first hurdle.,Increasing Intrinsic Value\\nBusiness growth, risk, margin, cash management, and size create the business’s intrinsic value. This value directly affects the company’s attractiveness to investors. The elements of intrinsic value include:,Growing businesses often add more support or sales people. Businesses that wish to increase profit may want to reduce expenses. Shorter receivables cycles can strengthen cash flow. The key is to assess how to achieve the improvements you desire. It’s vital to analyze business processes to improve financial and operating performance. And if necessary, you may need to re-engineer key processes.,Analysis of Business Processes\\nBy charting information flow, from prospect identification through order and into cash, businesses may uncover a range of shortcomings in quality, processing time, or overall efficiency.,Business Process Analysis\\nCharting the flow of information from prospect identification to order and from order to cash can reveal shortcomings in efficiencies, quality, and processing time. Average improvements are often significant, and can make a business more profitable and more attractive.,Risk and Liability Management\\nValuation is an art and a science. Buyers make projections with the assistance of historical financials. Debt is almost always less expensive than equity, but some multiple of EBITDA limits debt. Available debt leverage and equity costs create the weighted average cost of capital (WACC). WACC becomes a discount rate that is applied to financial projections to determine the company’s future cash flow stream’s net present value. This approach produces a prospective re-capitalization, and serves as the basis for an offer. That’s where the science ends.,The art begins with the assumptions that drive net present value calculations, and which link future risk to equity costs. Software developer models analyze components such as planning, sales, marketing, leadership, finance, legal, and operations, as well as the role these processes play in risk of future growth.,These models compare current risk to a benchmark that is ready for an initial public offering. Gaps between the reality and the ideal provide insights into ways to reduce risk and improve value.,Strategic Premium\\nThe value a strategic buyer determines is the unique product of the buyer’s existing company and the potential acquisition. The value, however, of the acquisition target as outlined in the formula above offers a useful base value. From there, valuation includes the synergies between the two entities—lower costs, increased sales, etc.,Synergy value may take years to develop, and can be disruptive if poorly planned or executed. Synergies are usually difficult to extract. They demand the merging of people, processes, and culture. Synergy value can be a powerful incentive and contribute to a higher price. But a seller lacks control over synergy value, and sellers rarely get full credit for this value in the final purchase price.,M&A Advisors and investment bankers utilize specific processes to identify potential buyers and offer them key information for evaluation. These advisors market the business and help the sale process move forward. They also negotiate terms.,Timing\\nIdentifying value enhancement opportunities is often a quick process that takes less than 90 days. But it can take much longer—up to two years—to achieve value enhancement goals. This is why identifying these goals well ahead of a sale is so important.,It’s true that a business is only worth what a buyer is willing to pay.\\nIt’s equally true that businesses must identify and optimize their value in anticipation of a sale. This sale preparation demands skill. Knowing where to seek help and how to achieve the biggest payback are vital.,The return on this investment is often significant. Business process re-engineering, risk reduction, and benchmarking make a company stronger and more valuable to existing owners, while increasing the company’s attractiveness to potential future buyers.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article28": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/11/One-Way-to-Decide-When-to-Sell-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"One Way to Decide When to Sell",
        "textList":"How do you know the right time to sell your company? One answer to this age-old question is that the time to sell is when someone else is willing to invest more in your business than you are.,When you start a business, nobody is willing to invest in its success more than you. You’ve already worked a 40-hour week by Wednesday and, if you’re like most founders, you’ve invested a big chunk of your liquid assets to get your business going.,You’re all in.,In the early days, you are willing to risk your business on a new strategy because the business is pretty much worthless. As the Bob Dylan lyric goes, “When you ain’t got nothing, you got nothing to lose.”,As your business grows and becomes more valuable, you may find yourself becoming more conservative, unwilling to risk the equity you have created inside your business on your next big idea. You have reached a point where someone else may be willing to risk more time and money for your business than you are.,Peach New Media,David Will is the founder of Peach New Media, which he started back in 2000 as a reseller of web conferencing. In the early days, Will changed his business strategy frequently, trying to find an idea with legs. After a number of pivots, he landed on selling learning management software to associations.,The business grew nicely and by 2015 Peach New Media had 40 employees and then received an attractive acquisition offer from a large private equity company. Will was conflicted. He loved his business and treasured the team he had built. At the same time, the acquirer was offering him a life-changing check.,In the end, Will realized that he had become somewhat more conservative as his business had grown and the potential acquirer was willing to make a big bet on integrating Peach New Media into another one of its acquisitions. Will realized he had reached a point where his appetite for risk in his own business was lower than his potential acquirer’s. Will decided to sell., ,When to Sell,The point where a buyer is willing to risk more than you are happens at a different stage for everyone. Let’s say you have a business worth $1 million today. Would you be willing to risk the entire thing on a new strategy for a shot at making it a $10 million company? Many entrepreneurs would take that bet.,Now imagine you have a company worth $10 million and your business represents the bulk of your net worth. Most would argue $10 million is life-changing money. Would you be willing to risk your entire company for a chance to make it a $100 million company? The marginal utility of an extra $90 million is minimal—we all only need so many cars—but the risk is significant. Fewer owners would bet $10 million for a chance at $100 million.,What if your business was worth $100 million? Would you risk it all for a long shot at becoming a billion-dollar company? It is hard to imagine any one person betting $100 million dollars on anything, but if you’re the CEO of a billion-dollar corporation with ambitious growth goals, $100 million is a bet you may be willing to make.,When someone else is willing to invest more in your business than you are, it is probably time your company finds a new owner.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article29": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/03/The-Benefits-of-an-MA-Advisor-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"The Benefits of an M&A Advisor",
        "textList":"You, the entrepreneur, by definition, are a person that does things on your own and knows how to get things accomplished. For this reason, it is not uncommon to think about handling the sale of your business on your own from start to finish. However, in many cases, the best entrepreneurs reach success because they understand the power of delegating. It pays to hire experts to guide you through specific situations.,Selling your business is likely the biggest transaction of your life and you only get one opportunity to do it right. For this reason, it behooves business owners to hire an experienced M&A Advisor or business intermediary to help them through the process.,Below we examine the benefits of using an M&A Advisor to represent you in the sale of your business:,1. Developing a Buyer Universe\\nAn M&A Advisor will work closely with you to understand your business and the industry sector that you operate in. They will then research the leading strategic acquirers and private equity groups that have investments, or have invested in your space, to compose a strong buyer list. They will reach out to this group of potential buyers (usually between 100 and 200) directly to gauge their interest in a possible transaction.,2. Positioning Your Business\\nFor buyers to have an in-depth understanding of your business an M&A Advisor will develop a detailed Confidential Information Memorandum (CIM) as the primary selling document for your business. The CIM will cover everything from the history and core competencies of your business to growth opportunities and biographies of key team members. The CIM will also include a financial section that details recast EBITDA and shows financial trends dating back a number of years. This section is very important to maximizing the value of your business.,3. Soliciting Offers\\nAfter the initial marketing phase, which includes reaching out to potential acquirers with a blind teaser and an NDA to execute for those wishing to see the CIM, your M&A Advisor will then solicit initial indications of interest. This will provide an idea of where the buyer universe sees the value of your business. From this point your M&A Advisor will work directly with you to pare down the list of potential acquirers and grant the serious parties a management meeting.,4. Negotiating\\nAfter those management meetings are complete your M&A Advisor will solicit a Letter of Intent (LOI) from the buyers and negotiate the best terms on your behalf.,5. Due Diligence\\nOnce terms have been agreed upon and the LOI is signed the due diligence process will kick off. It is during this phase that you can rely heavily on your M&A Advisor to help provide the needed information.,Selling your business can be a long and arduous process and it is important to have an experienced M&A Advisor guide you through the process.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article30": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/04/How-to-Avoid-7-Common-Deal-Killers-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"How to Avoid 7 Common Deal Killers",
        "textList":"Most business owners plan to leave their businesses within five years. Most of them will also fail to achieve this goal, and many won’t even be marginally ready for a sale when the five-year target arrives. Owner failure to identify and remedy deal killers lies at the heart of this problem.,These eight deal killers wreck a company’s sales potential when left undetected. But they can be fixed—if, and only if, an owner is willing to look at and address the problem. Here are the eight worst offenders, and how you can kill them.,These two deal killers share one thing in common: the incorrect assumption that a sale will be easier, and the price will be higher, than is realistic. Assuming things without research kills deals. The fact remains that owners often underestimate how much money they will need to make an exit. And because they’re emotionally invested in their businesses, they tend to greatly overestimate their value. This killer combination triggers an assortment of problems, with potential reverberations throughout the marketplace.,Get rid of these deal killers with ample pre-sale planning. Work with a tax expert to reduce taxes and fees, thereby getting you closer to your net proceed goals. Assemble and work with a team well before your exit date. This helps you avoid false starts that can lower your business’s value if you opt not to sell.,Employees are a business’s most valuable asset. You mustretain the after the sale for the business to succeed. Owners sometimes fail to consider how a sale might affect employees. They might also fail to realize that a new owner does not want to have to worry about hiring. Don’t allow employees to jump ship, or to try to negotiate for a cut of the sale price.,To slay this deal killer, you need to motivate your staff to stay. Consider a non-qualified       deferred compensation plan, non-solicitation agreements, and/or a stay bonus. This can keep good employees on board, and prevent those who do leave from harming the company.,It’s true that you know your business best, but do you know the entire market? Most owners are reluctant to partner with the team they need. This undermines their negotiating power. The buyer will likely have a skilled team assembled. Lone owners can be overwhelmed by the demands of such a team, causing them to essentially throw away money. A skilled and experienced deal team can help you plan for the negotiation process, ensuring you get the best possible deal, and preventing your inexperience from becoming a liability—or a source of manipulation—during the deal-making process.,Due diligence in anticipation of a sale can be costly, and might feel like little more than an annoyance. But foregoing it may decimate the value of the business, and add extensive work to the sale process. Due diligence alerts you early to potential problems, offering you the time you need to correct them.,To avoid this deal killer, the solution is simple: get a skilled pre-sale team involved early, and do your due-diligence before the business goes on the market. A little effort on the front end can save you time and money as you move forward.,Selling a company you’ve built is an emotional undertaking. Emotions can hinder your ability to think reasonably, causing cold feet and undermining even the best deals. Cold feet at the end of the process are common, but if you allow them to rule your decisions, you’ll lose money, productivity, and time.,Solve this deal killer by talking to people you trust. Honoring your emotions can prevent them   from harming your goals. Set clear post-exit goals, and ensure your sale plans address those.    Establish plans for the future. Ensure the business isn’t your sole source of fulfillment.,Deal killers are preventable with a bit of skill and a willingness to think strategically. Owners don’t typically have the experience necessarily to solve these deal killers on their own, so consider working with an expert team of planners and advisors. Doing so can grow the value of your business, protect your future, and offer support during the transfer process.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       },
       "article31": {
        "background":"https://advantedgeadvisors.com/wp-content/uploads/2017/02/What-is-My-Business-Worth-by-AdvantEdge-Advisors-Mergers-and-Acquisitions-Firm.jpg",
        "title":"What is My Business Worth?",
        "textList":"When thinking about taking your company to market the first thing that crosses the mind of most business owners is “what is my business worth?” Sure, you may have hired a valuation firm to put a value on your businesses for estate purposes, but those valuations have no concrete tie to what your business is really worth.,The real answer is that your business is worth what a buyer is willing to pay for it. Any buyer will perform their own valuation, which includes assessing the strategic value of your business in their hands. Your independent valuation, while helpful in some instances (estate planning, buy/sell agreements, etc.), is not something a buyer will consider when valuing your business.,Valuation Methods,Ok, so what are some other methods that a potential buyer will employ when trying to value your business? Comparable transactions are a reasonable way to understand the relative value of your business. If one of your competitors was recently acquired, and they offer similar products or services to you, it is reasonable to think that their value is in line with yours.,However, the strategic implications of the buyer can certainly swing the value one way or another. For example, a larger strategic competitor will certainly have more synergies and typically see greater value in your business than a purely financial buyer.,Another aspect sometimes used to value businesses is comparing your company that of publically traded companies in the same industry and then discounting the trading multiple. How much the multiple is discounted depends on the buyer, but generally the discount is usually somewhere in the 30% range. The discount is employed because privately held companies are not liquid in the way that public companies are.,Doing It the Hard Way,The best way to really find the value of your company is to put the work in. There is no simple model or formula that can truly generate an accurate valuation. Hiring an investment banker or M&A Advisor to market your business in a professional manner to multiple parties in the best way to really understand the value of your business.,An M&A Advisor or investment banker will put together a selling document called a Confidential Information Memorandum (CIM) detailing all aspects of your business including core competencies, growth opportunities, strategic considerations and historic and projected financials. This will really give potential buyers a true understanding of your business. An investment banker or M&A Advisor will also facilitate meetings between you and potential buyers so that those buyers can ask any questions and understand the potential of your business.,Marketing your business to multiple buyers in the hope of generating multiple offers in an auction setting will give you, the seller, the opportunity to understand the way multiple parties would value your business. If one of those offers is acceptable then you’ll truly know what the value on the business is.,So, like everything else in life, there is no easy way out. The only way to really understand the value of your business is to take it to market and put it in front of potential buyers.,PO Box 16946\\nMissoula, MT 59808,AdvantEdge Advisors has locations in Spokane, Washington and Missoula, Montana. We serve companies in the Pacific and Intermountain Northwest, representing area clients to buyers and sellers nationwide and internationally. Our core service territory includes the states of Washington, Idaho, Montana, North Dakota and South Dakota.\\nCities where we’ve closed transactions and are well-established with both buyers and sellers include (among others): Seattle, Everett and Spokane, Washington; Boise and Couer d’Alene, Idaho; Missoula, Kalispell, Bozeman, Great Falls and Billings, Montana; Williston, Minot and Dickinson, North Dakota."
       }
}
